Public Attributes | List of all members
API_CWPanelRelation Struct Reference
Element Manager API
Structure for retrieving connection data of a curtain wall panel, skylight, window or a door element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Guid  | fromRoom
Guid of the room connected to the requested element.
API_Guid  | toRoom
Guid of the room connected to the requested element.
double  | filler [8]
Detailed Description
Structure for retrieving connection data of a curtain wall panel, skylight, window or a door element.
Remarks
To learn more about the usage of this relation structure please refer to the ACAPI_Element_GetRelations function. See also API_SkylightRelation.
Member Data Documentation
◆ filler
 double API_CWPanelRelation::filler[8]
◆ fromRoom
 API_CWPanelRelation::fromRoom
Guid of the room connected to the requested element.
◆ toRoom
 API_CWPanelRelation::toRoom
Guid of the room connected to the requested element.